MAPS = ['china', '山东', '济南市', '长清区', '历下区', '市中区', '历城区', '福州市', '青岛市', '合肥市', '西安市', '成都市', '沈阳市', '乌鲁木齐市', '德阳市', '长沙市', '海口市', '广州市', '深圳市', '厦门市', '宁波市', '杭州市', '苏州市', '南京市', '徐州市', '淮南市', '泰安市', '威海市', '安徽', '福建', '广东', '海南', '湖南', '江苏', '辽宁', '陕西', '四川', '新疆', '浙江', '天津', '上海', '澳门' ]

DATA = [
  // { name: '👈山东一堆大学', value: '', loc: [117.029, 36.2499] },
  { name: '南方科技大学', value: '朱骐、杨晓荣、苏茹涵', loc: [114.0035, 22.6006], city: '广东 深圳市' },
  { name: '上海科技大学', value: '刘昱', loc: [121.594, 31.1771], city: '上海 上海市' },
  { name: '四川大学', value: '高淮峰', loc: [104.084, 30.6294], city: '四川 成都市' },
  { name: '华南理工大学', value: '任希晗', loc: [113.344978, 23.157851], city: '广东 广州市' },
  { name: '山东大学 中心校区', value: '周涵森', loc: [117.06, 36.6757], city: '山东 济南市 历城区' },
  { name: '山东大学 千佛山校区', value: '张泽', loc: [117.029, 36.6499], city: '山东 济南市 历下区' },
  { name: '山东大学 威海校区', value: '李逸霏、陈奕昂', loc: [122.0585, 37.533], city: '山东 威海市' },
  { name: '西安电子科技大学', value: '于洋', loc: [108.9165, 34.2309], city: '陕西 西安市' },
  { name: '东北大学', value: '仝家驹', loc: [123.4245, 41.6533], city: '辽宁 沈阳市' },
  { name: '中国石油大学', value: '张钛然', loc: [120.1755, 35.94295], city: '山东 青岛市' },
  { name: '上海对外经贸大学', value: '鹿雨桐', loc: [121.217, 31.04605], city: '上海 上海市' },
  { name: '杭州电子科技大学', value: '徐沁发', loc: [120.139590, 30.287117], city: '浙江 杭州市' },
  { name: '南京农业大学', value: '朱茂隆', loc: [118.843, 32.0335], city: '江苏 南京市' },
  { name: '合肥工业大学 翡翠湖校区', value: '刘明昊', loc: [117.203, 31.7691], city: '安徽 合肥市' },
  { name: '合肥工业大学 屯溪路校区', value: '张家才', loc: [117.2975, 31.8437], city: '安徽 合肥市' },
  { name: '海南大学', value: '徐了然', loc: [110.3295, 20.05605], city: '海南 海口市' },
  { name: '中国矿业大学', value: '李木子', loc: [117.1465, 34.21375], city: '江苏 徐州市' },
  { name: '福州大学', value: '杨云飞', loc: [119.195, 26.0579], city: '福建 福州市' },
  { name: '西南石油大学', value: '张贤明', loc: [104.1855, 30.8276], city: '四川 成都市' },
  { name: '宁波诺丁汉大学', value: '孟晓彤', loc: [121.563, 29.7996], city: '浙江 宁波市' },
  { name: '国防科技大学', value: '杨一凡', loc: [113.000691, 28.225318], city: '湖南 长沙市' },
  { name: '成都理工大学', value: '李庆虎', loc: [104.147, 30.67665], city: '四川 成都市' },
  { name: '山东师范大学 千佛山校区', value: '杨若涵、武原禾', loc: [117.0415, 36.6518], city: '山东 济南市 历下区' },
  { name: '山东师范大学 长清湖校区', value: '郭君婕、周安木', loc: [116.8345, 36.54505], city: '山东 济南市 长清区' },
  { name: '集美大学', value: '吴宇龙', loc: [118.0955, 24.57975], city: '福建 厦门市' },
  { name: '青岛大学', value: '赵汝恒、尤胜寒、翟松亭', loc: [120.422292, 36.069517], city: '山东 青岛市' },
  { name: '西安建筑科技大学', value: '胡松昀', loc: [108.754, 34.0148], city: '陕西 西安市' },
  { name: '天津工业大学', value: '倪想', loc: [117.1115, 39.0657], city: '天津 天津市' },
  { name: '西交利物浦大学', value: '赵雨晨', loc: [120.739105, 31.271835], city: '江苏 苏州市' },
  { name: '安徽理工大学', value: '赵正睿', loc: [117.022, 32.553], city: '安徽 淮南市' },
  { name: '齐鲁工业大学', value: '马翊轩', loc: [116.81, 36.55915], city: '山东 济南市 长清区' },
  { name: '中国民用航空飞行学院', value: '董雨佳佳', loc: [104.308, 30.9512], city: '四川 德阳市' },
  { name: '山东中医药大学', value: '李芃泽', loc: [116.802, 36.56085], city: '山东 济南市 长清区' },
  { name: '澳门科技大学', value: '臧铭辰', loc: [113.573, 22.1497], city: '澳门 澳门特别行政区' },
  { name: '济南大学', value: '鲁畅、王宜萱', loc: [116.9685, 36.61365], city: '山东 济南市 市中区' },
  { name: '山东财经大学', value: '纪翔', loc: [117.023, 36.62445], city: '山东 济南市 市中区' },
  { name: '山东农业大学', value: '孙竹妍', loc: [117.118, 36.19445], city: '山东 泰安市' },
  { name: '新疆医科大学', value: '黄轲欣', loc: [87.58005, 43.83765], city: '新疆 乌鲁木齐市' },
  { name: '中国科学技术大学', value: '徐明甲', loc: [117.269, 31.837], city: '安徽 合肥市' },
  { name: '福建农林大学', value: '支俏', loc: [119.239, 26.0825], city: '福建 福州市' }
];

var convertData = function () {
  var res = [];
  for (var i = 0; i < DATA.length; i++) {
    var geoCoord = DATA[i]['loc'];
    if (geoCoord) {
      res.push({
        name: DATA[i].name,
        value: geoCoord.concat(DATA[i].value).concat(DATA[i].city)
      });
    }
  }
  return res;
};